# messages.py

def get_user_data(user_data):
    return f"""
👤 Профиль:

❕ Ваш ID - {user_data[0]}

🏙️ Текущий город - {user_data[2]}

🗂 Всего заказов - {user_data[4]}
⭐️ Ваш рейтинг - 5
🔮 Свободных моделей - 7
"""

start_message = """
👋🏻 Здравствуйте ! Добро пожаловать в HeavenGrace

У нас вы можете найти лучших девочек для интимных встреч.

Выдача адресов происходит круглосуточно через бота или, в крайних случаях, через куратора!

Внимательней проверяйте адрес Telegram, остерегайтесь мошенников, спасибо, что выбираете нас!
"""

info_message = """
🔍 Информация

Дорогие пользователи,

Хотелось бы поделиться информацией о нашем проекте, который разработан для обеспечения быстрого и комфортного поиска. Теперь вам больше не потребуется затрачивать значительное количество времени и усилий на поиск идеального способа провести досуг.

Мы создали структуру нашего сервиса с учетом удобства для каждого пользователя. Это позволяет сделать выбор быстрее и более простым, убирая лишние сложности.

Почему бы вам не избежать дополнительных трудностей в поисках удовольствия?

Особое внимание следует уделить тому, что мы придерживаемся политики полной анонимности для наших клиентов и не требуем предоставления персональных данных.

С уважением,
Команда технической поддержки вашего эскорт агентства
"""

support_message = """
Техническая поддержка эскорт-агентства всегда готова помочь в случае возникновения любых технических проблем. Обращайтесь в неё, если у вас возникли трудности с доступом к платформе, проблемы с оплатой услуг, вопросы по функциональности бота. 

Чтобы получить качественную помощь, соблюдайте следующие правила:
1. При описании проблемы будьте максимально информативны. Укажите детали, ошибки, которые привели к проблеме.
2. Соблюдайте уважительное и корректное общение с сотрудниками поддержки.
3. Если проблема касается конфиденциальной информации, не раскрывайте личные данные в открытой переписке.

Сроки ответа технической поддержки колеблются:
- Первый уровень (10 минут): Быстрые ответы на общие вопросы и проблемы, которые могут быть решены быстро.
- Второй уровень (30 минут - 1 час): Сложные проблемы, требующие более глубокого анализа и решения.

Обращение в техническую поддержку позволит вам оперативно решить возникшие технические сложности и продолжить пользоваться услугами эскорт-агентства без перебоев.
"""

models_message = """
💝 Все анкеты проходили строгую проверку личности нашим агентством.

В городе {city} свободно 7 моделей. 
"""

model1 = """
😍 Алена • 19 лет, город {city}

🌇 Час - 6450₽
🏙 2 часа - 12700₽
🌃 Ночь - 26400₽

Грациозная красотка, которая очень любит себя показать и снимает реальную годноту в домашнем стиле. Любит шалить с дырочками и даже не против поиграться с попкой.

ℹ️ Для оформления нажмите на кнопку Оформить
"""

model2 = """
😍 Василиса • 25 лет, город {city}

🌇 Час - 5400₽
🏙 2 часа - 9450₽
🌃 Ночь - 15260₽

Обворожительная и сногсшибательная, ласковая и нежная! Всегда готова для приятных и весёлых встреч...

ℹ️ Для оформления нажмите на кнопку Оформить
"""

model3 = """
😍 Дарья • 21 год, город {city}

🌇 Час - 5240₽
🏙 2 часа - 9170₽
🌃 Ночь - 20960₽

Жаркая малышка с очень аппетитными формами и сладкими дырочками.Показывает всю роскошсть своего тела.

ℹ️ Для оформления нажмите на кнопку Оформить
"""

model4 = """
😍 Ксения • 18 лет, город {city}

🌇 Час - 6270₽
🏙 2 часа - 12450₽
🌃 Ночь - 23100₽

Девчонка не из робких и любит себя показать. С кайфом разминает свои дырочки и даже тащится от агрегата в попке.

ℹ️ Для оформления нажмите на кнопку Оформить
"""

model5 = """
😍 Марина • 23 года, город {city}

🌇 Час - 5700₽
🏙 2 часа - 9975₽
🌃 Ночь - 22800₽

Нимфа с 4-ым размером. Обожаю анал, ненасытная, принимаю с радостью в любую из своих дырочек, также люблю игрушки. 

ℹ️ Для оформления нажмите на кнопку Оформить
"""

model6 = """
😍 Кристина • 20 лет, город {city}

🌇 Час - 7670₽
🏙 2 часа - 15890₽
🌃 Ночь - 26200₽

Наслаждаюсь процессом и кончаю. Если хочешь получить искренние эмоции, то тебе ко мне. Очень люблю делать минет

ℹ️ Для оформления нажмите на кнопку Оформить
"""

model7 = """
😍 Ирина • 23 года, город {city}

🌇 Час - 3400₽
🏙 2 часа - 7000₽
🌃 Ночь - 13000₽

Молодая, гибкая, красивая

ℹ️ Для оформления нажмите на кнопку Оформить
"""

oznaks = """
Здравствуйте,

Хотелось бы поделиться важной информацией, чтобы гарантировать вашу безопасность в сотрудничестве с нами. Мы настоятельно рекомендуем избегать использования сторонних банковских реквизитов, которые могут быть предоставлены вам моделями или агентами технической поддержки. Это поможет избежать потенциальных случаев мошенничества.

Пожалуйста, используйте только те платежные реквизиты, которые указаны в нашем боте. Наша единственная учетная запись для технической поддержки имеет следующие данные: @DopeSupport. Это гарантирует вам надежное взаимодействие с нами.

После оформления заказа с моделью, не забудьте связаться с нашей службой поддержки через диалог, чтобы уточнить детали встречи, связанные с оплаченным заказом. Мы всегда готовы помочь вам и обеспечить гладкое и безопасное взаимодействие.

Спасибо за понимание и сотрудничество. В случае любых вопросов, не стесняйтесь обращаться к нам.

С наилучшими пожеланиями,
Команда технической поддержки вашего агентства.
""" 
